mermaid flow diagram added
